jn1904/O431-STM32F407/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY3_Pin GPIO_PIN_13
#define KEY3_GPIO_Port GPIOC
#define IMU_SPI_MISO_Pin GPIO_PIN_2
#define IMU_SPI_MISO_GPIO_Port GPIOC
#define IMU_SPI_MOSI_Pin GPIO_PIN_3
#define IMU_SPI_MOSI_GPIO_Port GPIOC
#define KEY1_Pin GPIO_PIN_0
#define KEY1_GPIO_Port GPIOA
#define LCD_SPI_SCK_Pin GPIO_PIN_5
#define LCD_SPI_SCK_GPIO_Port GPIOA
#define LCD_SPI_MISO_Pin GPIO_PIN_6
#define LCD_SPI_MISO_GPIO_Port GPIOA
#define LCD_SPI_MOSI_Pin GPIO_PIN_7
#define LCD_SPI_MOSI_GPIO_Port GPIOA
#define KEY2_Pin GPIO_PIN_8
#define KEY2_GPIO_Port GPIOE
#define LCD_SCL_Pin GPIO_PIN_10
#define LCD_SCL_GPIO_Port GPIOB
#define LCD_SDA_Pin GPIO_PIN_11
#define LCD_SDA_GPIO_Port GPIOB
#define IMU_SPI_SCK_Pin GPIO_PIN_13
#define IMU_SPI_SCK_GPIO_Port GPIOB
#define AHT_SCL_Pin GPIO_PIN_6
#define AHT_SCL_GPIO_Port GPIOB
#define AHT_SDA_Pin GPIO_PIN_7
#define AHT_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define TIME_OUT_TIME 10
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
